joristork/robots/jobot_in_c/microchip_extras/h/p18f63j90.h
extern volatile near unsigned char       LCDSE0;
extern volatile near union {
  struct {
    unsigned LCDSE0:8;
  };
  struct {
    unsigned SE0:1;
    unsigned SE1:1;
    unsigned SE2:1;
    unsigned SE3:1;
    unsigned SE4:1;
    unsigned SE5:1;
    unsigned SE6:1;
    unsigned SE7:1;
  };
  struct {
    unsigned SEGEN0:1;
    unsigned SEGEN1:1;
    unsigned SEGEN2:1;
    unsigned SEGEN3:1;
    unsigned SEGEN4:1;
    unsigned SEGEN5:1;
    unsigned SEGEN6:1;
    unsigned SEGEN7:1;
  };
  struct {
    unsigned SE00:1;
    unsigned SE01:1;
    unsigned SE02:1;
    unsigned SE03:1;
    unsigned SE04:1;
    unsigned SE05:1;
    unsigned SE06:1;
    unsigned SE07:1;
  };
} LCDSE0bits;
extern volatile near unsigned char       LCDPS;
extern volatile near union {
  struct {
    unsigned LP:4;
    unsigned WA:1;
    unsigned LCDA:1;
    unsigned BIASMD:1;
    unsigned WFT:1;
  };
  struct {
    unsigned LCDPS0:1;
    unsigned LCDPS1:1;
    unsigned LCDPS2:1;
    unsigned LCDPS3:1;
  };
  struct {
    unsigned LP0:1;
    unsigned LP1:1;
    unsigned LP2:1;
    unsigned LP3:1;
  };
} LCDPSbits;
extern volatile near unsigned char       RCSTA;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned RCD8:1;
    unsigned :5;
    unsigned RC9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_RC8:1;
  };
  struct {
    unsigned :6;
    unsigned RC8_9:1;
  };
  struct {
    unsigned RX9D1:1;
    unsigned OERR1:1;
    unsigned FERR1:1;
    unsigned ADDEN1:1;
    unsigned CREN1:1;
    unsigned SREN1:1;
    unsigned RX91:1;
    unsigned SPEN1:1;
  };
} RCSTAbits;
extern volatile near unsigned char       RCSTA1;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned RCD8:1;
    unsigned :5;
    unsigned RC9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_RC8:1;
  };
  struct {
    unsigned :6;
    unsigned RC8_9:1;
  };
  struct {
    unsigned RX9D1:1;
    unsigned OERR1:1;
    unsigned FERR1:1;
    unsigned ADDEN1:1;
    unsigned CREN1:1;
    unsigned SREN1:1;
    unsigned RX91:1;
    unsigned SPEN1:1;
  };
} RCSTA1bits;
extern volatile near unsigned char       TXSTA;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned SENDB:1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TXD8:1;
    unsigned :5;
    unsigned TX8_9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_TX8:1;
  };
  struct {
    unsigned TX9D1:1;
    unsigned TRMT1:1;
    unsigned BRGH1:1;
    unsigned SENDB1:1;
    unsigned SYNC1:1;
    unsigned TXEN1:1;
    unsigned TX91:1;
    unsigned CSRC1:1;
  };
} TXSTAbits;
extern volatile near unsigned char       TXSTA1;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned SENDB:1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TXD8:1;
    unsigned :5;
    unsigned TX8_9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_TX8:1;
  };
  struct {
    unsigned TX9D1:1;
    unsigned TRMT1:1;
    unsigned BRGH1:1;
    unsigned SENDB1:1;
    unsigned SYNC1:1;
    unsigned TXEN1:1;
    unsigned TX91:1;
    unsigned CSRC1:1;
  };
} TXSTA1bits;
extern volatile near unsigned char       TXREG;
extern volatile near unsigned char       TXREG1;
extern volatile near unsigned char       RCREG1;
extern volatile near unsigned char       SPBRG;
extern volatile near unsigned char       SPBRG1;
extern volatile near unsigned char       T3CON;
extern volatile near union {
  struct {
    unsigned TMR3ON:1;
    unsigned TMR3CS:1;
    unsigned NOT_T3SYNC:1;
    unsigned T3CCP1:1;
    unsigned T3CKPS:2;
    unsigned T3CCP2:1;
    unsigned RD16:1;
  };
  struct {
    unsigned :2;
    unsigned T3SYNC:1;
    unsigned :1;
    unsigned T3CKPS0:1;
    unsigned T3CKPS1:1;
  };
  struct {
    unsigned :2;
    unsigned T3INSYNC:1;
  };
} T3CONbits;
extern volatile near unsigned char       TMR3L;
extern volatile near unsigned char       TMR3H;
extern volatile near unsigned char       CMCON;
extern volatile near union {
  struct {
    unsigned CM:3;
    unsigned CIS:1;
    unsigned C1INV:1;
    unsigned C2INV:1;
    unsigned C1OUT:1;
    unsigned C2OUT:1;
  };
  struct {
    unsigned CM0:1;
    unsigned CM1:1;
    unsigned CM2:1;
  };
} CMCONbits;
extern volatile near unsigned char       CVRCON;
extern volatile near union {
  struct {
    unsigned CVR:4;
    unsigned CVRSS:1;
    unsigned CVRR:1;
    unsigned CVROE:1;
    unsigned CVREN:1;
  };
  struct {
    unsigned CVR0:1;
    unsigned CVR1:1;
    unsigned CVR2:1;
    unsigned CVR3:1;
  };
} CVRCONbits;
extern volatile near unsigned char       LCDSE1;
extern volatile near union {
  struct {
    unsigned LCDSE1:8;
  };
  struct {
    unsigned SE8:1;
    unsigned SE9:1;
    unsigned SE10:1;
    unsigned SE11:1;
    unsigned SE12:1;
    unsigned SE13:1;
    unsigned SE14:1;
    unsigned SE15:1;
  };
  struct {
    unsigned SEGEN8:1;
    unsigned SEGEN9:1;
    unsigned SEGEN10:1;
    unsigned SEGEN11:1;
    unsigned SEGEN12:1;
    unsigned SEGEN13:1;
    unsigned SEGEN14:1;
    unsigned SEGEN15:1;
  };
  struct {
    unsigned SE08:1;
    unsigned SE09:1;
  };
} LCDSE1bits;
extern volatile near unsigned char       LCDSE2;
extern volatile near union {
  struct {
    unsigned LCDSE2:8;
  };
  struct {
    unsigned SE16:1;
    unsigned SE17:1;
    unsigned SE18:1;
    unsigned SE19:1;
    unsigned SE20:1;
    unsigned SE21:1;
    unsigned SE22:1;
    unsigned SE23:1;
  };
  struct {
    unsigned SEGEN16:1;
    unsigned SEGEN17:1;
    unsigned SEGEN18:1;
    unsigned SEGEN19:1;
    unsigned SEGEN20:1;
    unsigned SEGEN21:1;
    unsigned SEGEN22:1;
    unsigned SEGEN23:1;
  };
} LCDSE2bits;
extern volatile near unsigned char       LCDSE3;
extern volatile near union {
  struct {
    unsigned LCDSE3:8;
  };
  struct {
    unsigned SE24:1;
    unsigned SE25:1;
    unsigned SE26:1;
    unsigned SE27:1;
    unsigned SE28:1;
    unsigned SE29:1;
    unsigned SE30:1;
    unsigned SE31:1;
  };
  struct {
    unsigned SEGEN24:1;
    unsigned SEGEN25:1;
    unsigned SEGEN26:1;
    unsigned SEGEN27:1;
    unsigned SEGEN28:1;
    unsigned SEGEN29:1;
    unsigned SEGEN30:1;
    unsigned SEGEN31:1;
  };
} LCDSE3bits;
